---
kind: type
id: T:Autodesk.Revit.DB.IFC.IFCFileReadOptions
source: html/3dc6542a-ed72-81a1-7cf8-8af17a6c2949.htm
---
# Autodesk.Revit.DB.IFC.IFCFileReadOptions

This class contains options to read an IFC file.

## Syntax (C#)
```csharp
public class IFCFileReadOptions : IDisposable
```